const app = require("./app");

//список тем (бургер кинг, СВО, айфон) с количеством упоминаний за день, неделю и всего
//создание темы (название, тип, промпт (ключевые слова), источники, география авторов (страна), фильтры (пост, сторис, комментарий))
//сводный отчет по теме (количество сообщений, авторов, вовлеченности и лояльности(отношение позитивных сообщений к негативным)) + график во времени + снизу самые резонансные сообщения по теме с ссылками
//выгрузка отчетов (pdf, xls, doc, json)
//аккаунт по подписке
//оповещения с настройками
//сравнение тем (конкурентный анализ)
//журнал (логи действий и активности)
//дашборды с обновлением в реальном времени

const port = process.env.PORT || 5000;
app.listen(port, () => {
  console.log(`Listening: http://localhost:${port}`);
});